#  Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками 
# (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

n = int (input ("Введите количество долек по длине шоколадки: ") )
m = int (input ("Введите количество долек по ширине шоколадки: ") )
k = int (input ("Введите количество долек, которое хочется отломить `за 1 клик`: ") )
if (k % n == 0 or k % m == 0) and k < n*m: 
    print ("Yes")
else: print ("No") 
