# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = int (input ("Введите трёхзначное число: ") )
print (n // 100 + (n % 100) // 10 + (n % 10))