# Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

ticketNumber = int (input ("Введите номер билета: ") )
while ticketNumber ==0 or ticketNumber // 1000000 > 0:
    ticketNumber = int (input ("Введите номер билета из 6 цифр: ") )
part1 = ticketNumber // 1000
part2 = ticketNumber % 1000
sumPart1 = part1 // 100 + part1 % 10 + part1 // 10 % 10
sumPart2 = part2 // 100 + part2 % 10 + part2 // 10 % 10
if sumPart1 == sumPart2 and ticketNumber != 0:
    print ("Yes")
else:
    print ("No")
    